In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
age = df[df['Age'] == 22]
age[['Name', 'Age']].head()

df['Age'].unique()

lst = list(df['Age'])
lst

[22.0,
 38.0,
 26.0,
 35.0,
 35.0,
 nan,
 54.0,
 2.0,
 27.0,
 14.0,
 4.0,
 58.0,
 20.0,
 39.0,
 14.0,
 55.0,
 2.0,
 nan,
 31.0,
 nan,
 35.0,
 34.0,
 15.0,
 28.0,
 8.0,
 38.0,
 nan,
 19.0,
 nan,
 nan,
 40.0,
 nan,
 nan,
 66.0,
 28.0,
 42.0,
 nan,
 21.0,
 18.0,
 14.0,
 40.0,
 27.0,
 nan,
 3.0,
 19.0,
 nan,
 nan,
 nan,
 nan,
 18.0,
 7.0,
 21.0,
 49.0,
 29.0,
 65.0,
 nan,
 21.0,
 28.5,
 5.0,
 11.0,
 22.0,
 38.0,
 45.0,
 4.0,
 nan,
 nan,
 29.0,
 19.0,
 17.0,
 26.0,
 32.0,
 16.0,
 21.0,
 26.0,
 32.0,
 25.0,
 nan,
 nan,
 0.83,
 30.0,
 22.0,
 29.0,
 nan,
 28.0,
 17.0,
 33.0,
 16.0,
 nan,
 23.0,
 24.0,
 29.0,
 20.0,
 46.0,
 26.0,
 59.0,
 nan,
 71.0,
 23.0,
 34.0,
 34.0,
 28.0,
 nan,
 21.0,
 33.0,
 37.0,
 28.0,
 21.0,
 nan,
 38.0,
 nan,
 47.0,
 14.5,
 22.0,
 20.0,
 17.0,
 21.0,
 70.5,
 29.0,
 24.0,
 2.0,
 21.0,
 nan,
 32.5,
 32.5,
 54.0,
 12.0,
 nan,
 24.0,
 nan,
 45.0,
 33.0,
 20.0,
 47.0,
 29.0,
 25.0,
 23.0,
 19.0,
 37.0,
 16.0,
 24.0,
 nan,
 22.0,
 24.0,
 19.0,
 18.0,
 19.0,
 27.0,
 9.0,
 36.5,
 42.0,
 51.0,
 22.0,
 55.5,
 40.5,
 nan,
 51.0,
 16.0,
 30.0,
 nan,
 nan,
 44.0,
 40.0,
 26.0,
 17.0,
 1.0,
 9.0,
 nan,
 45.0,
 nan,
 28.0,
 61.0,
 4.0,
 1.0,
 21.0,
 56.0,
 18.0,
 nan,
 50.0,
 30.0,
 36.0,
 nan,
 nan,
 9.0,
 1.0,
 4.0,
 nan,
 nan,
 45.0,
 40.0,
 36.0,
 32.0,
 19.0,
 19.0,
 3.0,
 44.0,
 58.0,
 nan,
 42.0,
 nan,
 24.0,
 28.0,
 nan,
 34.0,
 45.5,
 18.0,
 2.0,
 32.0,
 26.0,
 16.0,
 40.0,
 24.0,
 35.0,
 22.0,
 30.0,
 nan,
 31.0,
 27.0,
 42.0,
 32.0,
 30.0,
 16.0,
 27.0,
 51.0,
 nan,
 38.0,
 22.0,
 19.0,
 20.5,
 18.0,
 nan,
 35.0,
 29.0,
 59.0,
 5.0,
 24.0,
 nan,
 44.0,
 8.0,
 19.0,
 33.0,
 nan,
 nan,
 29.0,
 22.0,
 30.0,
 44.0,
 25.0,
 24.0,
 37.0,
 54.0,
 nan,
 29.0,
 62.0,
 30.0,
 41.0,
 29.0,
 nan,
 30.0,
 35.0,
 50.0,
 nan,
 3.0,
 52.0,
 40.0,
 nan,
 36.0,
 16.0,
 25.0,
 58.0,
 35.0,
 nan,
 25.0,
 41.0,
 37.0,
 nan,
 63.0,
 45.0,
 nan,
 7.0,
 35.0,
 65.0,
 28.0,
 16.0,
 19.0,
 nan,
 33.0,
 30.0,
 22.0,
 42.0,
 22.0,
 26.0,
 19.0,
 36.0,
 24.0,
 24.0,
 nan,
 23.5,
 2.0,
 nan,
 50.0,
 nan,
 nan,
 19.0,
 nan,
 nan,
 0.92,
 nan,
 17.0,
 30.0,
 30.0,
 24.0,
 18.0,
 26.0,
 28.0,
 43.0,
 26.0,
 24.0,
 54.0,
 31.0,
 40.0,
 22.0,
 27.0,
 30.0,
 22.0,
 nan,
 36.0,
 61.0,
 36.0,
 31.0,
 16.0,
 nan,
 45.5,
 38.0,
 16.0,
 nan,
 nan,
 29.0,
 41.0,
 45.0,
 45.0,
 2.0,
 24.0,
 28.0,
 25.0,
 36.0,
 24.0,
 40.0,
 nan,
 3.0,
 42.0,
 23.0,
 nan,
 15.0,
 25.0,
 nan,
 28.0,
 22.0,
 38.0,
 nan,
 nan,
 40.0,
 29.0,
 45.0,
 35.0,
 nan,
 30.0,
 60.0,
 nan,
 nan,
 24.0,
 25.0,
 18.0,
 19.0,
 22.0,
 3.0,
 nan,
 22.0,
 27.0,
 20.0,
 19.0,
 42.0,
 1.0,
 32.0,
 35.0,
 nan,
 18.0,
 1.0,
 36.0,
 nan,
 17.0,
 36.0,
 21.0,
 28.0,
 23.0,
 24.0,
 22.0,
 31.0,
 46.0,
 23.0,
 28.0,
 39.0,
 26.0,
 21.0,
 28.0,
 20.0,
 34.0,
 51.0,
 3.0,
 21.0,
 nan,
 nan,
 nan,
 33.0,
 nan,
 44.0,
 nan,
 34.0,
 18.0,
 30.0,
 10.0,
 nan,
 21.0,
 29.0,
 28.0,
 18.0,
 nan,
 28.0,
 19.0,
 nan,
 32.0,
 28.0,
 nan,
 42.0,
 17.0,
 50.0,
 14.0,
 21.0,
 24.0,
 64.0,
 31.0,
 45.0,
 20.0,
 25.0,
 28.0,
 nan,
 4.0,
 13.0,
 34.0,
 5.0,
 52.0,
 36.0,
 nan,
 30.0,
 49.0,
 nan,
 29.0,
 65.0,
 nan,
 50.0,
 nan,
 48.0,
 34.0,
 47.0,
 48.0,
 nan,
 38.0,
 nan,
 56.0,
 nan,
 0.75,
 nan,
 38.0,
 33.0,
 23.0,
 22.0,
 nan,
 34.0,
 29.0,
 22.0,
 2.0,
 9.0,
 nan,
 50.0,
 63.0,
 25.0,
 nan,
 35.0,
 58.0,
 30.0,
 9.0,
 nan,
 21.0,
 55.0,
 71.0,
 21.0,
 nan,
 54.0,
 nan,
 25.0,
 24.0,
 17.0,
 21.0,
 nan,
 37.0,
 16.0,
 18.0,
 33.0,
 nan,
 28.0,
 26.0,
 29.0,
 nan,
 36.0,
 54.0,
 24.0,
 47.0,
 34.0,
 nan,
 36.0,
 32.0,
 30.0,
 22.0,
 nan,
 44.0,
 nan,
 40.5,
 50.0,
 nan,
 39.0,
 23.0,
 2.0,
 nan,
 17.0,
 nan,
 30.0,
 7.0,
 45.0,
 30.0,
 nan,
 22.0,
 36.0,
 9.0,
 11.0,
 32.0,
 50.0,
 64.0,
 19.0,
 nan,
 33.0,
 8.0,
 17.0,
 27.0,
 nan,
 22.0,
 22.0,
 62.0,
 48.0,
 nan,
 39.0,
 36.0,
 nan,
 40.0,
 28.0,
 nan,
 nan,
 24.0,
 19.0,
 29.0,
 nan,
 32.0,
 62.0,
 53.0,
 36.0,
 nan,
 16.0,
 19.0,
 34.0,
 39.0,
 nan,
 32.0,
 25.0,
 39.0,
 54.0,
 36.0,
 nan,
 18.0,
 47.0,
 60.0,
 22.0,
 nan,
 35.0,
 52.0,
 47.0,
 nan,
 37.0,
 36.0,
 nan,
 49.0,
 nan,
 49.0,
 24.0,
 nan,
 nan,
 44.0,
 35.0,
 36.0,
 30.0,
 27.0,
 22.0,
 40.0,
 39.0,
 nan,
 nan,
 nan,
 35.0,
 24.0,
 34.0,
 26.0,
 4.0,
 26.0,
 27.0,
 42.0,
 20.0,
 21.0,
 21.0,
 61.0,
 57.0,
 21.0,
 26.0,
 nan,
 80.0,
 51.0,
 32.0,
 nan,
 9.0,
 28.0,
 32.0,
 31.0,
 41.0,
 nan,
 20.0,
 24.0,
 2.0,
 nan,
 0.75,
 48.0,
 19.0,
 56.0,
 nan,
 23.0,
 nan,
 18.0,
 21.0,
 nan,
 18.0,
 24.0,
 nan,
 32.0,
 23.0,
 58.0,
 50.0,
 40.0,
 47.0,
 36.0,
 20.0,
 32.0,
 25.0,
 nan,
 43.0,
 nan,
 40.0,
 31.0,
 70.0,
 31.0,
 nan,
 18.0,
 24.5,
 18.0,
 43.0,
 36.0,
 nan,
 27.0,
 20.0,
 14.0,
 60.0,
 25.0,
 14.0,
 19.0,
 18.0,
 15.0,
 31.0,
 4.0,
 nan,
 25.0,
 60.0,
 52.0,
 44.0,
 nan,
 49.0,
 42.0,
 18.0,
 35.0,
 18.0,
 25.0,
 26.0,
 39.0,
 45.0,
 42.0,
 22.0,
 nan,
 24.0,
 nan,
 48.0,
 29.0,
 52.0,
 19.0,
 38.0,
 27.0,
 nan,
 33.0,
 6.0,
 17.0,
 34.0,
 50.0,
 27.0,
 20.0,
 30.0,
 nan,
 25.0,
 25.0,
 29.0,
 11.0,
 nan,
 23.0,
 23.0,
 28.5,
 48.0,
 35.0,
 nan,
 nan,
 nan,
 36.0,
 21.0,
 24.0,
 31.0,
 70.0,
 16.0,
 30.0,
 19.0,
 31.0,
 4.0,
 6.0,
 33.0,
 23.0,
 48.0,
 0.67,
 28.0,
 18.0,
 34.0,
 33.0,
 nan,
 41.0,
 20.0,
 36.0,
 16.0,
 51.0,
 nan,
 30.5,
 nan,
 32.0,
 24.0,
 48.0,
 57.0,
 nan,
 54.0,
 18.0,
 nan,
 5.0,
 nan,
 43.0,
 13.0,
 17.0,
 29.0,
 nan,
 25.0,
 25.0,
 18.0,
 8.0,
 1.0,
 46.0,
 nan,
 16.0,
 nan,
 nan,
 25.0,
 39.0,
 49.0,
 31.0,
 30.0,
 30.0,
 34.0,
 31.0,
 11.0,
 0.42,
 27.0,
 31.0,
 39.0,
 18.0,
 39.0,
 33.0,
 26.0,
 39.0,
 35.0,
 6.0,
 30.5,
 nan,
 23.0,
 31.0,
 43.0,
 10.0,
 52.0,
 27.0,
 38.0,
 27.0,
 2.0,
 nan,
 nan,
 1.0,
 nan,
 62.0,
 15.0,
 0.83,
 nan,
 23.0,
 18.0,
 39.0,
 21.0,
 nan,
 32.0,
 nan,
 20.0,
 16.0,
 30.0,
 34.5,
 17.0,
 42.0,
 nan,
 35.0,
 28.0,
 nan,
 4.0,
 74.0,
 9.0,
 16.0,
 44.0,
 18.0,
 45.0,
 51.0,
 24.0,
 nan,
 41.0,
 21.0,
 48.0,
 nan,
 24.0,
 42.0,
 27.0,
 31.0,
 nan,
 4.0,
 26.0,
 47.0,
 33.0,
 47.0,
 28.0,
 15.0,
 20.0,
 19.0,
 nan,
 56.0,
 25.0,
 33.0,
 22.0,
 28.0,
 25.0,
 39.0,
 27.0,
 19.0,
 nan,
 26.0,
 32.0]

In [4]:
# 1. Check if a list contains an element
14 in lst

True

In [5]:
# 2. How to iterate over 2+ lists at the same time
name = df['Name'].head()
age = df['Age'].head()
sex = df['Sex'].head()
z = zip(name, age, sex)
for name,age, sex in z:
    print("%s is %s is %s" % (name,age, sex))

Braund, Mr. Owen Harris is 22.0 is male
Cumings, Mrs. John Bradley (Florence Briggs Thayer) is 38.0 is female
Heikkinen, Miss. Laina is 26.0 is female
Futrelle, Mrs. Jacques Heath (Lily May Peel) is 35.0 is female
Allen, Mr. William Henry is 35.0 is male

In [5]:
ls_name = list(df['Name'].head())
ls_age = list(df['Age'].head())
ls_sex = list(df['Sex'].head())

new_ls = [ls_name, ls_age]
new_ls

# len(new_ls)

# new_ls = ls_name.append(ls_age)
# new_ls

[['Braund, Mr. Owen Harris',
  'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
  'Heikkinen, Miss. Laina',
  'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
  'Allen, Mr. William Henry'],
 [22.0, 38.0, 26.0, 35.0, 35.0]]

In [129]:
# 6.extend
ls_age = list(df['Age'].head())
ls_sex = list(df['Sex'].head())
ls_age.append(ls_sex)
ls_age

[22.0, 38.0, 26.0, 35.0, 35.0, ['male', 'female', 'female', 'female', 'male']]

In [128]:
# 6. append
ls_age = list(df['Age'].head())
ls_sex = list(df['Sex'].head())
ls_age.extend(ls_sex)
ls_age

[22.0, 38.0, 26.0, 35.0, 35.0, 'male', 'female', 'female', 'female', 'male']

In [84]:
# 10. Remove duplicates from a list
list_age = list(df['Age'].head(20))
list(set(list_age))

[nan,
 nan,
 2.0,
 35.0,
 4.0,
 58.0,
 38.0,
 39.0,
 nan,
 14.0,
 20.0,
 55.0,
 22.0,
 54.0,
 26.0,
 27.0,
 31.0]

In [86]:
# 9.1. “remove”
list_age.remove(27)
list_age

[22.0,
 38.0,
 26.0,
 35.0,
 nan,
 54.0,
 2.0,
 14.0,
 4.0,
 58.0,
 20.0,
 39.0,
 14.0,
 55.0,
 2.0,
 nan,
 31.0,
 nan]

In [88]:
# 9.2. “pop”
list_age.pop(3)
list_age

[22.0,
 38.0,
 26.0,
 nan,
 54.0,
 2.0,
 14.0,
 4.0,
 58.0,
 20.0,
 39.0,
 14.0,
 55.0,
 2.0,
 nan,
 31.0,
 nan]

In [90]:
# 11. index of the 1st matching element
list_age.index(26)

2

In [96]:
# 12. Remove all elements from a list
nl = list(df['Age'].head(10))
nl.clear()
nl

[]

In [109]:
# 13. Iterate over both the values in a list and their indices
for idx, val in enumerate(ls_age):
    print("%s: %s" % (idx, val))

0: 22.0
1: 38.0
2: 26.0
3: 35.0
4: 35.0

In [111]:
# 14. How to concatenate two lists
print(ls_name + ls_age)

['Braund, Mr. Owen Harris', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'Heikkinen, Miss. Laina', 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'Allen, Mr. William Henry', 22.0, 38.0, 26.0, 35.0, 35.0]

In [115]:
# 15. manipulate every element in a list with list comprehension
print(ls_age)
[i+1 for i in ls_age]

[22.0, 38.0, 26.0, 35.0, 35.0]

In [116]:
# 16. Count the occurrence of a specific object in a list
ls_age.count(35)

2

In [118]:
# 17. copy a list
print(ls_name)
ls_name_copy = ls_name.copy()
ls_name_copy

['Braund, Mr. Owen Harris', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'Heikkinen, Miss. Laina', 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'Allen, Mr. William Henry']

['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry']

In [120]:
# 22. Return the length of a list
print(len(ls_age))

5

In [45]:
# 24. How to check if an element is not in a list?
print(ls_age)
38 not in ls_age
# 55 in ls_age

[22.0, 38.0, 26.0, 35.0, 35.0]

False

In [44]:
# 25. Multiply every element in a list by 5 with the map function
def multiply_5(ls_age):
    return ls_age * 5
[val for val in map(multiply_5, ls_age)]

[110.0, 190.0, 130.0, 175.0, 175.0]

In [129]:
# 26. Combine 2 lists into a list of tuples with the zip function
list(zip(ls_age, ls_name, ls_sex))

[(22.0, 'Braund, Mr. Owen Harris', 'male'),
 (38.0, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female'),
 (26.0, 'Heikkinen, Miss. Laina', 'female'),
 (35.0, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female'),
 (35.0, 'Allen, Mr. William Henry', 'male')]

In [130]:
# 27. Insert a value at a specific index in an existing list
ls_age.insert(2, 'HERE')
ls_age

[22.0, 38.0, 'HERE', 26.0, 35.0, 35.0]

In [133]:
ls_age.remove('HERE')
ls_age

[22.0, 38.0, 26.0, 35.0, 35.0]

In [134]:
# 29. Remove negative values from a list with the filter function
def remove_negatives(x):
    return True if x >= 35 else False
[x for x in filter(remove_negatives, ls_age)]

[38.0, 35.0, 35.0]

In [16]:
# 30. Convert a list into a dictionary where list elements are keys
{k:1 for k in ls_age}

{22.0: 1, 38.0: 1, 26.0: 1, 35.0: 1}

In [15]:
# 31. Modify an existing list with a lambda function
list(map(lambda val:val*5, ls_age))

[110.0, 190.0, 130.0, 175.0, 175.0]

In [23]:
# 32. Remove elements in a list after a specific index
age = list(df['Age'].head(10))
print(age)
age[:6]

[22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

[22.0, 38.0, 26.0, 35.0, 35.0, nan]

In [25]:
# 33. Remove elements in a list before a specific index
age = list(df['Age'].head(10))
print(age)
age[6:]

[22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

[54.0, 2.0, 27.0, 14.0]

In [28]:
# 34. Remove elements in a list between 2 indices
age = list(df['Age'].head(10))
print(age)
age[4:7]

[22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

[35.0, nan, 54.0]

In [29]:
# 35. Return every 2nd element in a list between 2 indices
age = list(df['Age'].head(10))
print(age)
age[2:4:7]

[22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

[26.0]

In [46]:
# 38. Filter even values out of a list with list comprehension
age2 = list(df['Age'].head(10))
[i for i in age2 if i % 2 != 0]

[35.0, 35.0, nan, 27.0]

In [50]:
# 39. Count occurrences of each value in a list
# from collections import Counter
age2 = list(df['Age'].head(10))
Counter(age2)

Counter({22.0: 1,
         38.0: 1,
         26.0: 1,
         35.0: 2,
         nan: 1,
         54.0: 1,
         2.0: 1,
         27.0: 1,
         14.0: 1})

In [55]:
# 40. Get the first element from each nested list in a list
ls_name1 = list(df['Name'].head(3))
ls_age1 = list(df['Age'].head(3))
ls_sex1 = list(df['Sex'].head(3))
l = [ls_name1, ls_age1, ls_sex1]
l
[i[0] for i in l]

['Braund, Mr. Owen Harris', 22.0, 'male']

In [56]:
# 42. Combine elements in a list into a single string.
' '.join(ls_name1)

'Braund, Mr. Owen Harris Cumings, Mrs. John Bradley (Florence Briggs Thayer) Heikkinen, Miss. Laina'

In [58]:
# 43. What’s the affect of multiplying a list by an integer?
ls_age1 *3

[22.0, 38.0, 26.0, 22.0, 38.0, 26.0, 22.0, 38.0, 26.0]

In [63]:
# 44. Use the “any” function to return True if any value in a list is divisible by 2
l1 = ls_age1 *3
l2 = [1,3]
any(i % 2 == 0 for i in l1) 
# any(i % 2 == 0 for i in l2)

True

In [71]:
# 45. Use the “all” function to return True if all values in a list are negative
li1 = [2,3,4]
li2 = [2,4]
all(i % 2 == 0 for i in li1)
# all(i % 2 == 0 for i in li2)

False

In [11]:
# 47. What kind of copy would the list constructor create from an existing list?
ls_pid = list(df['PassengerId'].head(15))
li = list(ls_pid)
li.append('abcd')
print(ls_pid)
print(li)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 'abcd']

In [9]:
# 48. Reverse the order of a list
ls_pid = list(df['PassengerId'].head(15))
print(ls_pid)
ls_pid.reverse()
ls_pid

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

[15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [20]:
# 49. What is the difference between reverse and reversed?
ls_pid = list(df['PassengerId'].head(15))
print(ls_pid)
l = list(reversed(ls_pid))
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

[15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [23]:
# 50. What is the difference between sort and sorted?
# print(l)
# l.sort()
# l

print(l)
ls = sorted(l)
ls

[15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [24]:
# 51. Return the minimum value in a list
ls_pid = list(df['PassengerId'].head(15))
min(ls_pid)

1

In [25]:
# 52. Return the maximum value in a list
ls_pid = list(df['PassengerId'].head(15))
max(ls_pid)

15

In [26]:
# 53. Return the sum of values in a list
ls_pid = list(df['PassengerId'].head(15))
sum(ls_pid)

120

In [31]:
# 54. Use a list as a stack
ls_pid = list(df['PassengerId'].head(10))
ls_pid.append('Jess')
ls_pid.append('Todd')
ls_pid.append('Yuan')
print(ls_pid)
print(ls_pid.pop())
print(ls_pid)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 'Jess', 'Todd', 'Yuan']
Yuan
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 'Jess', 'Todd']

In [32]:
# 55. Find the intersection of 2 lists
li1 = [1,2,3]
li2 = [2,3,4]
set(li1) & set(li2)

{2, 3}

In [42]:
# 56. Find the difference between a set and another set
li1 = [1,2,3]
li2 = [2,3,4]
print(set(li1) - set(li2))
print(set(li2) - set(li1))
print(set(li1) & set(li2))

{1}
{4}
{2, 3}

In [38]:
# 57. Flatten a list of lists with a list comprehensions
li = [[1,2,3],[4,5,6]]
[i for x in li for i in x]

[1, 2, 3, 4, 5, 6]

In [39]:
# 58. Generate a list of every integer between 2 values
list(range(5,10))

[5, 6, 7, 8, 9]

In [40]:
# 59. Combine 2 lists into a dictionary
name = ['Snowball', 'Chewy', 'Bubbles', 'Gruff']
animal = ['Cat', 'Dog', 'Fish', 'Goat']
dict(zip(name, animal))

{'Snowball': 'Cat', 'Chewy': 'Dog', 'Bubbles': 'Fish', 'Gruff': 'Goat'}

In [41]:
# 60. Reverse the order of a list using the slice syntax
li = ['a','b',3,4]
li[::-1]

[4, 3, 'b', 'a']

In [123]:
# 13. Iterate over both the values in a list and their indices
ls_name = list(df['Name'].head())
for idx,i in enumerate(ls_name):
    print("%s: %s" %(idx, i))

0: Braund, Mr. Owen Harris
1: Cumings, Mrs. John Bradley (Florence Briggs Thayer)
2: Heikkinen, Miss. Laina
3: Futrelle, Mrs. Jacques Heath (Lily May Peel)
4: Allen, Mr. William Henry

In [49]:
ls_name.index('Allen, Mr. William Henry')

4

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
for idx,name in enumerate(ls_name):
    if(name == 'Allen, Mr. William Henry'):
        print(df['Ticket'][idx])

373450

In [17]:
ls_age = list(df['Age'].head(15))
for idx,age in enumerate(ls_age):
    if(age >30):
        print(df['Ticket'][idx])

PC 17599
113803
373450
17463
113783
347082

In [71]:
name = list(df['Name'].head())
ticket = list(df['Ticket'].head())
age = list(df['Age'].head())
a = list(zip(name, ticket))
dict(zip(a, age))

{('Braund, Mr. Owen Harris', 'A/5 21171'): 22.0,
 ('Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'PC 17599'): 38.0,
 ('Heikkinen, Miss. Laina', 'STON/O2. 3101282'): 26.0,
 ('Futrelle, Mrs. Jacques Heath (Lily May Peel)', '113803'): 35.0,
 ('Allen, Mr. William Henry', '373450'): 35.0}

In [106]:
name = list(df['Name'].head(3))
d = ','.join(name)
d

'Braund, Mr. Owen Harris,Cumings, Mrs. John Bradley (Florence Briggs Thayer),Heikkinen, Miss. Laina'

In [107]:
d.split(',')

['Braund',
 ' Mr. Owen Harris',
 'Cumings',
 ' Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen',
 ' Miss. Laina']

In [77]:
fare = list(df['Fare'].head(10))
min(fare)

7.25

In [75]:
max(fare)

71.2833

In [76]:
sum(fare)

147.6083

In [80]:
sex = list(df['Sex'].head())
print(sex)
list(set(sex))

['male', 'female', 'female', 'female', 'male']

['male', 'female']

In [81]:
age = list(df['Age'].head(10))
print(age)

[22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

In [93]:
def age_greater_than_30(x):
    return True if x > 30 else False
new = [x for x in filter(age_greater_than_30, age)]
new

[38.0, 35.0, 35.0, 54.0]

In [94]:
def use_of_map(val):
    return val *5
new_map = [val for val in map(use_of_map, new)]
new_map

[190.0, 175.0, 175.0, 270.0]

In [96]:
list(map(lambda val: val*5, new))

[190.0, 175.0, 175.0, 270.0]

In [91]:
con = df[(df['Age'] > 30)]
con.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S

In [5]:
s = df[['PassengerId', 'Name', 'Age', 'Sex']]
con = s[(s['Age'] > 30)]
con.head(10)

,PassengerId,Name,Age,Sex
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,female
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,female
4,5,"Allen, Mr. William Henry",35.0,male
6,7,"McCarthy, Mr. Timothy J",54.0,male
11,12,"Bonnell, Miss. Elizabeth",58.0,female
13,14,"Andersson, Mr. Anders Johan",39.0,male
15,16,"Hewlett, Mrs. (Mary D Kingcome)",55.0,female
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",31.0,female
20,21,"Fynney, Mr. Joseph J",35.0,male
21,22,"Beesley, Mr. Lawrence",34.0,male

In [8]:
con = s[(s['Sex'] == 'female') & (s['Age'] > 30)]
con.head(10)

,PassengerId,Name,Age,Sex
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,female
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,female
11,12,"Bonnell, Miss. Elizabeth",58.0,female
15,16,"Hewlett, Mrs. (Mary D Kingcome)",55.0,female
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",31.0,female
25,26,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",38.0,female
40,41,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",40.0,female
52,53,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",49.0,female
61,62,"Icard, Miss. Amelie",38.0,female
85,86,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",33.0,female

In [119]:
name = list(df['Name'].head(10))
age = list(df['Age'].head(10))
name.append('Sourav')
print(name)

['Braund, Mr. Owen Harris', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'Heikkinen, Miss. Laina', 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'Allen, Mr. William Henry', 'Moran, Mr. James', 'McCarthy, Mr. Timothy J', 'Palsson, Master. Gosta Leonard', 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 'Nasser, Mrs. Nicholas (Adele Achem)', 'Sourav']

In [118]:
name = list(df['Name'].head(10))
age = list(df['Age'].head(10))
name.extend(age)
print(name)

['Braund, Mr. Owen Harris', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'Heikkinen, Miss. Laina', 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'Allen, Mr. William Henry', 'Moran, Mr. James', 'McCarthy, Mr. Timothy J', 'Palsson, Master. Gosta Leonard', 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 'Nasser, Mrs. Nicholas (Adele Achem)', 22.0, 38.0, 26.0, 35.0, 35.0, nan, 54.0, 2.0, 27.0, 14.0]

In [122]:
# 28. Subtract values in a list from the first element with the reduce function
from functools import reduce
age = list(df['Age'].head(4))
def sub(a, b):
    return a - b
reduce(sub, age)

-77.0

In [4]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [23]:
from functools import reduce
pclass = list(df['Pclass'].head(10))
print(pclass)
def sub(a, b):
    return a - b
reduce(sub, pclass)

[3, 1, 3, 1, 3, 3, 1, 3, 3, 2]

-17